; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v10)
             (pred_10 ?v7 ?v4)
             (pred_5 ?v12 ?v4)
             (pred_7 ?v2 ?v12 )
	     (pred_9 ?v12)
             (pred_3 ?v5)
             (pred_1 ?v7)
             (pred_11 ?v4)
             (pred_6 ?v12)
             (pred_2 ?v7)
             (pred_8 ?v12)
             (pred_12 ))



(:action op_3
:parameters (?v1 ?v9 ?v11 ?v3)
:precondition (and (pred_3 ?v1) (pred_3 ?v9) (pred_1 ?v11) (pred_11 ?v3)
          (pred_4 ?v1 ?v9) (pred_10 ?v11 ?v3)
                   (pred_5 ?v9 ?v3) (pred_9 ?v1) 
                   (pred_6 ?v9) (pred_2 ?v11))
:effect (and  (pred_8 ?v9) (not (pred_6 ?v9))))


(:action op_4
:parameters (?v1 ?v8)
:precondition (and (pred_3 ?v1) (pred_3 ?v8)
               (pred_9 ?v1) (pred_4 ?v1 ?v8) (pred_8 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_1 ?v11) 
                  (pred_9 ?v1) (pred_7 ?v11 ?v1) (pred_12 ))
:effect (and (pred_2 ?v11)
   (not (pred_7 ?v11 ?v1)) (not (pred_12 ))))


(:action op_1
:parameters (?v1 ?v13 ?v6)
:precondition (and (pred_3 ?v1) (pred_1 ?v13) (pred_1 ?v6)
                  (pred_9 ?v1) (pred_2 ?v6) (pred_7 ?v13 ?v1))
:effect (and (pred_2 ?v13) (pred_7 ?v6 ?v1)
        (not (pred_2 ?v6)) (not (pred_7 ?v13 ?v1))))

(:action op_2
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_1 ?v11) 
                  (pred_9 ?v1) (pred_2 ?v11))
:effect (and (pred_12 ) (pred_7 ?v11 ?v1) (not (pred_2 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_12 obj_13 obj_03 obj_09 obj_02 obj_08 obj_01 obj_04
    obj_07 obj_11
    obj_05 obj_06
    )

    (:init
       (pred_12)

       (pred_3 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_03)
       (pred_3 obj_09)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_06)

       (pred_4 obj_10 obj_03)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_13 obj_02)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_02 obj_04)
       (pred_4 obj_02 obj_13)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_04 obj_02)
       (pred_4 obj_04 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_5  obj_02 obj_07)
       (pred_5  obj_12 obj_11)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_04)

       (pred_10  obj_05 obj_07)
       (pred_10  obj_06 obj_11)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_06 obj_08)
       (pred_9 obj_03)
    )

    (:goal (and
       (pred_7 obj_05 obj_04)
       (pred_7 obj_06 obj_03)
    ))
(:constraints
  (always (not (pred_9 obj_09)))
)
)

; plan
1. (op_4 obj_03 obj_08)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_08)
   goals met: 0 of 2
2. (op_5 obj_08 obj_06)
   deleted: (pred_7 obj_06 obj_08) (pred_12)
   added: (pred_2 obj_06)
   goals met: 0 of 2
3. (op_4 obj_08 obj_03)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_03)
   goals met: 0 of 2
4. (op_2 obj_03 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_12) (pred_7 obj_06 obj_03)
   goals met: 1 of 2
5. (op_4 obj_03 obj_10)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_10)
   goals met: 1 of 2
6. (op_5 obj_10 obj_05)
   deleted: (pred_7 obj_05 obj_10) (pred_12)
   added: (pred_2 obj_05)
   goals met: 1 of 2
7. (op_4 obj_10 obj_03)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_03)
   goals met: 1 of 2
8. (op_4 obj_03 obj_08)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_08)
   goals met: 1 of 2
9. (op_4 obj_08 obj_01)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_01)
   goals met: 1 of 2
10. (op_4 obj_01 obj_04)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_04)
   goals met: 1 of 2
11. (op_2 obj_04 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_12) (pred_7 obj_05 obj_04)
   goals met: 2 of 2
